;;-*- coding: utf-8; lexical-binding: t; -*-
#+title: Emacs: New Config in an Org file
#+STARTUP: overview
#+property: header-args:emacs-lisp  :tangle ~/.emacs.d/init.el :results none

** Backup settings

Creates a .saves directory and puts backup files in there.

Shuts off backup creation for remote files
https://www.gnu.org/software/emacs/manual/html_node/tramp/Auto_002dsave-File-Lock-and-Backup.html
#+begin_src emacs-lisp
    ;; Backup settings
    (setq
     make-backup-files t
     backup-by-copying t
     backup-directory-alist '(("." . "~/.saves"))
     delete-old-versions t
     auto-save-mode nil
     auto-save-file-name-transforms `((".*" ,temporary-file-directory t)))

    ;;; Disable auto-save and auto-backup.
    ;;; Especially in development directories, we can't have emacs creating random #lockfiles# everywhere
    (setq create-lockfiles nil)
    (setq backup-directory-alist
	  `((".*" . ,temporary-file-directory)))
    (setq auto-save-file-name-transforms
	  `((".*" ,temporary-file-directory t)))
    ;;; End Disable auto-save and auto-backup

    ;;To turn off the backup feature for remote files and stop TRAMP from saving to the backup directory, use this:
    (add-to-list 'backup-directory-alist
		 (cons tramp-file-name-regexp nil))
#+end_src

#+RESULTS:
: ((^/\(\(?:\([[:alnum:]-]+\):\(?:\([^/|: 	]+\)@\)?\(\(?:[[:alnum:]_.%-]+\|\[\(?:\(?:[[:alnum:]]*:\)+[[:alnum:].]+\)?]\)\(?:#[[:digit:]]+\)?\)?|\)+\)?\([[:alnum:]-]+\):\(?:\([^/|: 	]+\)@\)?\(\(?:[[:alnum:]_.%-]+\|\[\(?:\(?:[[:alnum:]]*:\)+[[:alnum:].]+\)?]\)\(?:#[[:digit:]]+\)?\)?:\([^
: ]*\'\)) (.* . /tmp/))

** Rainbow Delimiters
#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

#+RESULTS:
| rainbow-delimiters-mode |

** Configure org babel languages
#+begin_src emacs-lisp
  (require 'ob-js)

  (org-babel-do-load-languages
   'org-babel-load-languages
   '((lisp . t)
     (graphql . t)
     (ruby . t)
     (emacs-lisp . t)
     (python . t)
     (perl . t)
     (haskell . t)
     (C . t)
     (shell . t)
     (rust . t)
     (js . t)))

  (push '("conf" . conf-unix) org-src-lang-modes)

  (add-to-list 'org-babel-tangle-lang-exts '("js" . "js"))
#+end_src

#+RESULTS:
: ((conf-unix . conf-unix) (redis . redis) (php . php) (arduino . arduino) (conf-unix . conf-unix) (C . c) (C++ . c++) (asymptote . asy) (bash . sh) (beamer . latex) (calc . fundamental) (cpp . c++) (ditaa . artist) (dot . fundamental) (elisp . emacs-lisp) (ocaml . tuareg) (screen . shell-script) (shell . sh) (sqlite . sql))

*** Basic face annotator
#+begin_src emacs-lisp
  ;; Create annotator
  (defun my-face-annotator (cand)
    (when-let (sym (intern-soft cand))
      (concat (propertize " " 'display '(space :align-to center))
	      (propertize "The quick brown fox jumps over the lazy dog" 'face sym))))

  ;; Wire it up in the registry
  (add-to-list 'marginalia-annotator-registry
	       '(face my-face-annotator marginalia-annotate-face builtin none))
#+end_src

#+RESULTS:
| face                 | my-face-annotator                        | marginalia-annotate-face    | builtin | none |
| command              | marginalia-annotate-command              | marginalia-annotate-binding | builtin | none |
| embark-keybinding    | marginalia-annotate-embark-keybinding    | builtin                     | none    |      |
| customize-group      | marginalia-annotate-customize-group      | builtin                     | none    |      |
| variable             | marginalia-annotate-variable             | builtin                     | none    |      |
| function             | marginalia-annotate-function             | builtin                     | none    |      |
| face                 | marginalia-annotate-face                 | builtin                     | none    |      |
| color                | marginalia-annotate-color                | builtin                     | none    |      |
| unicode-name         | marginalia-annotate-char                 | builtin                     | none    |      |
| minor-mode           | marginalia-annotate-minor-mode           | builtin                     | none    |      |
| symbol               | marginalia-annotate-symbol               | builtin                     | none    |      |
| environment-variable | marginalia-annotate-environment-variable | builtin                     | none    |      |
| input-method         | marginalia-annotate-input-method         | builtin                     | none    |      |
| coding-system        | marginalia-annotate-coding-system        | builtin                     | none    |      |
| charset              | marginalia-annotate-charset              | builtin                     | none    |      |
| package              | marginalia-annotate-package              | builtin                     | none    |      |
| imenu                | marginalia-annotate-imenu                | builtin                     | none    |      |
| bookmark             | marginalia-annotate-bookmark             | builtin                     | none    |      |
| file                 | marginalia-annotate-file                 | builtin                     | none    |      |
| project-file         | marginalia-annotate-project-file         | builtin                     | none    |      |
| buffer               | marginalia-annotate-buffer               | builtin                     | none    |      |
| consult-multi        | marginalia-annotate-consult-multi        | builtin                     | none    |      |

Disabling Annotators
https://github.com/minad/marginalia#disabling-annotators-builtin-or-lightweight-annotators

* Projects: Projectile | Consult-projectile
   #+begin_src emacs-lisp
     ;; 17-Apr-2024 this was breaking eglot
     ;; (require-with-check 'project) was throwing
     ;; 18-Apr-2024 Update: I think maybe it was trying to use project.el from the recipe
     ;;   recipe looks like (project :type git :host github :repo "emacs-straight/project" :files ("*" (:exclude ".git")))
     ;;   so seems plausible, adding :straight nil
     (use-package project
       :straight nil
       :custom
       (project-vc-merge-submodules . nil))

     (use-package projectile
       :bind-keymap ("C-c p" . projectile-command-map))

     (use-package consult-projectile
       :straight (consult-projectile :type git :host gitlab :repo "OlMon/consult-projectile" :branch "master"))

     ;; ;; we need this wrapper to match Projectile's API
     ;; (defun projectile-project-current (dir)
     ;;   "Retrieve the root directory of the project at DIR using `project-current'."
     ;;   (cdr (project-current nil dir)))

     ;; (setq projectile-project-root-functions '(projectile-project-current))

     (projectile-mode)
   #+end_src

   #+RESULTS:
   | projectile-project-current |

*** Csharp/omnisharp/dotnet

#+begin_src emacs-lisp
  ;; (use-package csharp-mode
  ;;   :config
  ;;   (add-to-list 'auto-mode-alist '("\\.cs\\'" . csharp-tree-sitter-mode)))
#+end_src

#+RESULTS:
| lsp-deferred |

So this essentially uses async-shell-command and finds the local test or nearest project to run.

The output isn't as rich as even vterm so I'm commenting this out again for now 24-Oct-2023

(setq *cmd* "dotnet test /home/trevor/projects/goddard/src/ipaas-leads-api/Goddard.LeadsApi.IntegrationTests/Goddard.LeadsApi.IntegrationTests.csproj --filter \"InsertLead\"")
(async-shell-command *cmd* "*dotnet*")

#+begin_src emacs-lisp
  (use-package dotnet)
#+end_src

Trying Sharper
#+begin_src emacs-lisp
  (use-package sharper
    :bind
    ("C-c n s" . sharper-main-transient))
#+end_src

* MCT mode
#+begin_src emacs-lisp :tangle no
(straight-use-package '(mct :repo "protesilaos/mct"
			    :host gitlab))


(mct-mode 1)

(setq mct-remove-shadowed-file-names t) ; works when `file-name-shadow-mode' is enabled
(setq mct-hide-completion-mode-line t)
(setq mct-show-completion-line-numbers nil)
(setq mct-apply-completion-stripes t)
(setq mct-minimum-input 3)
(setq mct-live-update-delay 0.0)
#+end_src

#+RESULTS:
: 0.0

